Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.this["aschmahmann"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:aschmahmann"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["daviddias"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:daviddias"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["jacobheun"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:jacobheun"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["jbenet"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:jbenet"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["marten-seemann"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:marten-seemann"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["momack2"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:momack2"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["p-shahi"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:p-shahi"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.this["whyrusleeping"] will be updated in-place
  ~ resource "github_membership" "this" {
        id       = "libp2p:whyrusleeping"
      ~ role     = "admin" -> "member"
        # (2 unchanged attributes hidden)
    }

  # github_repository_file.this["py-libp2p/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "py-libp2p"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["security/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "security"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 8 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->